---
type: Selection
namespace: Autodesk.Revit.UI.Selection
version: 2024
members: 13
tags: [revit-api, class]
---

# Selection

`Autodesk.Revit.UI.Selection.Selection` · Revit 2024 · 13 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetElementIds | — | `public ICollection < ElementId > GetElementIds ()` |
| Method | GetReferences | 2023 | `public IList < Reference > GetReferences ()` |
| Method | PickBox | — | `` |
| Method | PickElementsByRectangle | — | `` |
| Method | PickElementsByRectangle | — | `public IList < Element > PickElementsByRectangle ()` |
| Method | PickObject | — | `` |
| Method | PickObjects | — | `` |
| Method | PickPoint | — | `` |
| Method | PickPoint | — | `public XYZ PickPoint ()` |
| Method | SetElementIds | 2015 | `public void SetElementIds ( ICollection < ElementId > elementIds )` |
| Method | SetReferences | 2023 | `public void SetReferences ( IList < Reference > references )` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |